; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image1 - mode
	thermograph0 - mode
	spectrograph2 - mode
	spectrograph3 - mode
	Star3 - direction
	Star4 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	Star0 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image1)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 spectrograph3)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 Star0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
)
(:goal (and
	(pointing satellite0 Star10)
	(pointing satellite1 GroundStation1)
	(have_image Star6 spectrograph3)
	(have_image Phenomenon7 spectrograph3)
	(have_image Phenomenon8 spectrograph2)
	(have_image Phenomenon9 spectrograph2)
	(have_image Star10 image1)
	(have_image Star11 thermograph0)
	(have_image Star12 image1)
))

)

; plan
1. (turn_to satellite1 groundstation5 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 groundstation5)
   goals met: 0 of 9
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 9
3. (calibrate satellite1 instrument4 groundstation5)
   added: (calibrated instrument4)
   goals met: 0 of 9
4. (turn_to satellite1 star12 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 star12)
   goals met: 0 of 9
5. (take_image satellite1 star12 instrument4 image1)
   added: (have_image star12 image1)
   goals met: 1 of 9
6. (turn_to satellite1 star10 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star10)
   goals met: 1 of 9
7. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 9
8. (calibrate satellite0 instrument2 groundstation5)
   added: (calibrated instrument2)
   goals met: 1 of 9
9. (take_image satellite1 star10 instrument4 image1)
   added: (have_image star10 image1)
   goals met: 2 of 9
10. (turn_to satellite0 phenomenon7 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 9
11. (take_image satellite0 phenomenon7 instrument2 spectrograph3)
   added: (have_image phenomenon7 spectrograph3)
   goals met: 3 of 9
12. (turn_to satellite0 phenomenon8 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 9
13. (take_image satellite0 phenomenon8 instrument2 spectrograph2)
   added: (have_image phenomenon8 spectrograph2)
   goals met: 4 of 9
14. (turn_to satellite0 phenomenon9 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 9
15. (take_image satellite0 phenomenon9 instrument2 spectrograph2)
   added: (have_image phenomenon9 spectrograph2)
   goals met: 5 of 9
16. (turn_to satellite0 star11 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star11)
   goals met: 5 of 9
17. (take_image satellite0 star11 instrument2 thermograph0)
   added: (have_image star11 thermograph0)
   goals met: 6 of 9
18. (turn_to satellite0 star6 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star6)
   goals met: 6 of 9
19. (take_image satellite0 star6 instrument2 spectrograph3)
   added: (have_image star6 spectrograph3)
   goals met: 7 of 9
20. (turn_to satellite0 star10 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star10)
   goals met: 8 of 9
21. (turn_to satellite1 groundstation1 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 groundstation1)
   goals met: 9 of 9
